Duet3D/Duet3Expansion/src/atmel/SAMC20_DFP/1.1.95/samc20/atdf/ATSAMC20G15A.atdf
          </instance>
        </module>
        <module name="DMAC" id="U2223" version="2.2.1">
          <instance name="DMAC">
            <register-group name="DMAC" name-in-module="DMAC" address-space="base" offset="0x41006000"/>
            <parameters>
              <param name="CH_BITS" value="3"/>
              <param name="CH_NUM" value="6"/>
              <param name="EVIN_NUM" value="4"/>
              <param name="EVOUT_NUM" value="4"/>
              <param name="LVL_BITS" value="2"/>
              <param name="LVL_NUM" value="4"/>
              <param name="QOSCTRL_D_RESETVALUE" value="2"/>
              <param name="QOSCTRL_F_RESETVALUE" value="2"/>
              <param name="QOSCTRL_WRB_RESETVALUE" value="2"/>
              <param name="TRIG_BITS" value="6"/>
              <param name="TRIG_NUM" value="49"/>
              <param name="INSTANCE_ID" value="35"/>
            </parameters>
          </instance>
        </module>
        <module name="DSU" id="U2209" version="2.5.0">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x41002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="33"/>
            </parameters>
          </instance>
        </module>
        <module name="EIC" id="U2254" version="2.0.3">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x40002800"/>
            <signals>
              <signal group="EXTINT" index="0" function="A" pad="PA16"/>
              <signal group="EXTINT" index="0" function="A" pad="PA00"/>
              <signal group="EXTINT" index="1" function="A" pad="PA17"/>
              <signal group="EXTINT" index="1" function="A" pad="PA01"/>
              <signal group="EXTINT" index="2" function="A" pad="PA02"/>
              <signal group="EXTINT" index="2" function="A" pad="PA18"/>
              <signal group="EXTINT" index="2" function="A" pad="PB02"/>
              <signal group="EXTINT" index="3" function="A" pad="PA03"/>
              <signal group="EXTINT" index="3" function="A" pad="PA19"/>
              <signal group="EXTINT" index="3" function="A" pad="PB03"/>
              <signal group="EXTINT" index="4" function="A" pad="PA04"/>
              <signal group="EXTINT" index="4" function="A" pad="PA20"/>
              <signal group="EXTINT" index="5" function="A" pad="PA05"/>
              <signal group="EXTINT" index="5" function="A" pad="PA21"/>
              <signal group="EXTINT" index="6" function="A" pad="PA06"/>
              <signal group="EXTINT" index="6" function="A" pad="PA22"/>
              <signal group="EXTINT" index="6" function="A" pad="PB22"/>
              <signal group="EXTINT" index="7" function="A" pad="PA07"/>
              <signal group="EXTINT" index="7" function="A" pad="PA23"/>
              <signal group="EXTINT" index="7" function="A" pad="PB23"/>
              <signal group="EXTINT" index="8" function="A" pad="PB08"/>
              <signal group="EXTINT" index="8" function="A" pad="PA28"/>
              <signal group="EXTINT" index="9" function="A" pad="PA09"/>
              <signal group="EXTINT" index="9" function="A" pad="PB09"/>
              <signal group="EXTINT" index="10" function="A" pad="PA10"/>
              <signal group="EXTINT" index="10" function="A" pad="PA30"/>
              <signal group="EXTINT" index="10" function="A" pad="PB10"/>
              <signal group="EXTINT" index="11" function="A" pad="PA11"/>
              <signal group="EXTINT" index="11" function="A" pad="PA31"/>
              <signal group="EXTINT" index="11" function="A" pad="PB11"/>
              <signal group="EXTINT" index="12" function="A" pad="PA12"/>
              <signal group="EXTINT" index="12" function="A" pad="PA24"/>
              <signal group="EXTINT" index="13" function="A" pad="PA13"/>
              <signal group="EXTINT" index="13" function="A" pad="PA25"/>
              <signal group="EXTINT" index="14" function="A" pad="PA14"/>
              <signal group="EXTINT" index="15" function="A" pad="PA27"/>
              <signal group="EXTINT" index="15" function="A" pad="PA15"/>
              <signal group="NMI" function="A" pad="PA08"/>
            </signals>
            <parameters>
              <param name="EXTINT_NUM" value="16"/>
              <param name="GCLK_ID" value="2"/>
              <param name="NUMBER_OF_CONFIG_REGS" value="2"/>
              <param name="NUMBER_OF_INTERRUPTS" value="16"/>
              <param name="INSTANCE_ID" value="10"/>
            </parameters>
          </instance>
        </module>
        <module name="EVSYS" id="U2256" version="1.0.1">
          <instance name="EVSYS">
            <register-group name="EVSYS" name-in-module="EVSYS" address-space="base" offset="0x42000000"/>
            <parameters>
              <param name="CHANNELS" value="6"/>
              <param name="CHANNELS_BITS" value="3"/>
              <param name="CHANNELS_MSB" value="5"/>
              <param name="EXTEVT_NUM" value="0"/>
              <param name="GENERATORS" value="87"/>
              <param name="GENERATORS_BITS" value="7"/>
              <param name="USERS" value="47"/>
              <param name="USERS_BITS" value="6"/>
              <param name="INSTANCE_ID" value="64"/>
            </parameters>
          </instance>
        </module>
        <module name="FREQM" id="U2257" version="1.0.1">
          <instance name="FREQM">
            <register-group name="FREQM" name-in-module="FREQM" address-space="base" offset="0x40002C00"/>
            <parameters>
              <param name="GCLK_ID_MSR" value="3"/>
              <param name="GCLK_ID_REF" value="4"/>
              <param name="INSTANCE_ID" value="11"/>
            </parameters>
          </instance>
        </module>
        <module name="GCLK" id="U2122" version="1.1.1">
          <instance name="GCLK">
            <register-group name="GCLK" name-in-module="GCLK" address-space="base" offset="0x40001C00"/>
            <signals>
              <signal group="IO" index="0" function="H" pad="PB22"/>
              <signal group="IO" index="0" function="H" pad="PA14"/>
              <signal group="IO" index="0" function="H" pad="PA27"/>
              <signal group="IO" index="0" function="H" pad="PA30"/>
              <signal group="IO" index="0" function="H" pad="PA28"/>
              <signal group="IO" index="1" function="H" pad="PB23"/>
              <signal group="IO" index="1" function="H" pad="PA15"/>
              <signal group="IO" index="2" function="H" pad="PA16"/>
              <signal group="IO" index="3" function="H" pad="PA17"/>
              <signal group="IO" index="4" function="H" pad="PA10"/>
              <signal group="IO" index="4" function="H" pad="PA20"/>
              <signal group="IO" index="4" function="H" pad="PB10"/>
              <signal group="IO" index="5" function="H" pad="PA11"/>
              <signal group="IO" index="5" function="H" pad="PA21"/>
              <signal group="IO" index="5" function="H" pad="PB11"/>
              <signal group="IO" index="6" function="H" pad="PA22"/>
              <signal group="IO" index="7" function="H" pad="PA23"/>
            </signals>
            <parameters>
              <param name="GENDIV_BITS" value="16"/>
              <param name="GEN_BITS" value="4"/>
              <param name="GEN_NUM" value="9"/>
              <param name="GEN_NUM_MSB" value="8"/>
              <param name="GEN_SOURCE_NUM_MSB" value="7"/>
              <param name="NUM" value="41"/>
              <param name="SOURCE_BITS" value="3"/>
              <param name="SOURCE_FDPLL" value="7"/>
              <param name="SOURCE_GCLKGEN1" value="2"/>
              <param name="SOURCE_GCLKIN" value="1"/>
              <param name="SOURCE_NUM" value="8"/>
              <param name="SOURCE_OSCULP32K" value="3"/>
              <param name="SOURCE_OSC32K" value="4"/>
              <param name="SOURCE_XOSC" value="0"/>
              <param name="SOURCE_XOSC32K" value="5"/>
              <param name="INSTANCE_ID" value="7"/>
            </parameters>
          </instance>
        </module>
        <module name="HMATRIXB" id="I7638" version="2.1.3">
          <instance name="HMATRIXHS">
            <register-group name="HMATRIXHS" name-in-module="HMATRIXB" address-space="base" offset="0x4100A000"/>
            <parameters>
              <param name="MASTER_NUM" value="3"/>
              <param name="MASTER_CM0PLUS" value="0"/>
              <param name="MASTER_DSU" value="1"/>
              <param name="MASTER_DMAC" value="2"/>
              <param name="SLAVE_NUM" value="8"/>
              <param name="SLAVE_FLASH" value="0"/>
              <param name="SLAVE_HSRAMCM0P" value="1"/>
              <param name="SLAVE_HSRAMDSU" value="2"/>
              <param name="SLAVE_HPB1" value="3"/>
              <param name="SLAVE_HPB0" value="4"/>
              <param name="SLAVE_HPB2" value="5"/>
              <param name="SLAVE_LPRAMDMAC" value="6"/>
              <param name="SLAVE_DIVAS" value="7"/>
              <param name="INSTANCE_ID" value="37"/>
            </parameters>
          </instance>
        </module>
        <module name="MCLK" id="U2234" version="2.0.0">
          <instance name="MCLK">
            <register-group name="MCLK" name-in-module="MCLK" address-space="base" offset="0x40000800"/>
            <parameters>
              <param name="CTRLA_MCSEL_GCLK" value="1"/>
              <param name="CTRLA_MCSEL_OSC8M" value="0"/>
              <param name="MCLK_CLK_APB_NUM" value="3"/>
              <param name="SYSTEM_CLOCK" value="4000000"/>
              <param name="INSTANCE_ID" value="2"/>
            </parameters>
            <clock-groups>
              <clock-group name="AHB" grouporder="0">
                <clock name="HPB0" bit="0"/>
                <clock name="HPB1" bit="1"/>
                <clock name="HPB2" bit="2"/>
                <clock name="DSU" bit="3"/>
                <clock name="HMATRIXHS" bit="4"/>
                <clock name="NVMCTRL" bit="5"/>
                <clock name="HSRAM" bit="6"/>
                <clock name="DMAC" bit="7"/>
                <clock name="PAC" bit="10"/>
                <clock name="NVMCTRL_PICACHU" bit="11"/>
                <clock name="DIVAS" bit="12"/>
              </clock-group>
            </clock-groups>
          </instance>
        </module>
        <module name="MTB" id="U2002" version="1.0.0">
          <instance name="MTB">
            <register-group name="MTB" name-in-module="MTB" address-space="base" offset="0x41008000"/>
            <parameters>
              <param name="INSTANCE_ID" value="36"/>
            </parameters>
          </instance>
        </module>
        <module name="NVMCTRL" id="U2207" version="4.0.1">
          <instance name="NVMCTRL">
            <register-group name="NVMCTRL" name-in-module="NVMCTRL" address-space="base" offset="0x41004000"/>
            <signals>
              <signal group="MARGIN" function="default" pad="VMARGIN"/>
            </signals>
            <parameters>
              <param name="FACTORY_WORD_IMPLEMENTED_MASK" value="0XC0000007FFFFFFFF"/>
              <param name="GCLK_ID" value="39"/>
              <param name="PMSB" value="3"/>
              <param name="PSZ_BITS" value="6"/>
              <param name="USER_PAGE_OFFSET" value="0x00800000"/>
              <param name="USER_WORD_IMPLEMENTED_MASK" value="0XC01FFFFFFFFFFFFF"/>
              <param name="RWWEE_PAGES" value="128"/>
              <param name="RWW_EEPROM_ADDR" value="0x00400000"/>
              <param name="RWW_EEPROM_SIZE" value="1024"/>
              <param name="FLASH_SIZE" value="32768"/>
              <param name="PAGE_SIZE" value="64"/>
              <param name="PAGES" value="512"/>
              <param name="PAGES_PR_REGION" value="32"/>
                  <!--  From Datasheet section "Electrical Characteristics","Flash Characteristics" table "Maximum operating Frequency" -->
                  <param name="PSM_0_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
                  <param name="PSM_0_FRMLP_FWS_0_MAX_FREQ" value="18000000"/>
                  <param name="PSM_0_FRMLP_FWS_1_MAX_FREQ" value="36000000"/>
                  <param name="PSM_0_FRMHS_FWS_0_MAX_FREQ" value="25000000"/>
                  <param name="PSM_0_FRMHS_FWS_1_MAX_FREQ" value="50000000"/>
                  <param name="PSM_1_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
                  <param name="PSM_1_FRMLP_FWS_0_MAX_FREQ" value="8000000"/>
                  <param name="PSM_1_FRMLP_FWS_1_MAX_FREQ" value="12000000"/>
              <param name="INSTANCE_ID" value="34"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="U2207" version="4.0.1">
          <instance name="FUSES">
            <register-group name="OTP3_FUSES" name-in-module="OTP3_FUSES" address-space="fuses" offset="0x00806010"/>
            <register-group name="OTP5_FUSES" name-in-module="OTP5_FUSES" address-space="fuses" offset="0x00806020"/>
            <register-group name="TEMP_LOG_FUSES" name-in-module="TEMP_LOG_FUSES" address-space="fuses" offset="0x00806030"/>
